http/netty/component/src/main/resources/payloads/payload1K.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <m0:getQuote xmlns:m0="http://services.samples">
            <m0:request>
                <m0:symbol>WSO2</m0:symbol>
                <m0:symbol>WSO2</m0:symbol>
                <m0:symbol>WSO2</m0:symbol>
                <m0:symbol>WSO2</m0:symbol>
                <m0:symbol>WSO2</m0:symbol>
                <m0:symbol>WSO2</m0:symbol>
                <m0:symbol>WSO2</m0:symbol>
                <m0:symbol>WSO2</m0:symbol>
                <m0:symbol>WSO2</m0:symbol>
                <m0:symbol>WSO2</m0:symbol>
                <m0:symbol>WSO2</m0:symbol>
                <m0:symbol>WSO2</m0:symbol>
                <m0:symbol>WSO2</m0:symbol>
                <m0:symbol>WSO2</m0:symbol>
                <m0:symbol>WSO2</m0:symbol>
            </m0:request>
        </m0:getQuote>
    </soapenv:Body>
</soapenv:Envelope>