src/main/wso2mi/artifacts/apis/MessageProcessor_v1.0.0.xml

<?xml version="1.0" encoding="UTF-8"?>
<api xmlns="http://ws.apache.org/ns/synapse" name="MessageProcessor" context="/default" version="1.0.0" version-type="context">
    <resource methods="POST" url-mapping="/getMarketActivity">
        <inSequence>
            <header name="SOAPAction" action="set" scope="transport" value="urn:getMarketActivity"/>
            <property name="REST_URL_POSTFIX" scope="axis2" action="remove"/>
            <payloadFactory media-type="xml" template-type="freemarker">
                <format><![CDATA[<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
<soapenv:Header/>
<soapenv:Body>
<web:getMarketActivity xmlns:web="http://services.samples"><#if payload.getMarketActivity.request?has_content><web:request><web:symbols ARRAY_PLACEHOLDER="payload.getMarketActivity.request.symbols">${symbols}</web:symbols></web:request></#if></web:getMarketActivity></soapenv:Body>
</soapenv:Envelope>
]]></format><args/>
            </payloadFactory><property name="messageType" value="application/soap+xml" scope="axis2" type="STRING"/><call><endpoint key="MessageProcessor_SOAP_ENDPOINT"/>
            </call><property name="messageType" value="application/json" scope="axis2" type="STRING"/><respond/>
        </inSequence><outSequence/><faultSequence/>
    </resource><resource methods="POST" url-mapping="/getSimpleQuote"><inSequence><header name="SOAPAction" action="set" scope="transport" value="urn:getSimpleQuote"/><property name="REST_URL_POSTFIX" scope="axis2" action="remove"/><payloadFactory media-type="xml" template-type="freemarker"><format><![CDATA[<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
<soapenv:Header/>
<soapenv:Body>
<web:getSimpleQuote xmlns:web="http://services.samples"><#if payload.getSimpleQuote.symbol?has_content><web:symbol>${payload.getSimpleQuote.symbol}</web:symbol></#if></web:getSimpleQuote></soapenv:Body>
</soapenv:Envelope>
]]></format><args/>
            </payloadFactory><property name="messageType" value="application/soap+xml" scope="axis2" type="STRING"/><call><endpoint key="MessageProcessor_SOAP_ENDPOINT"/>
            </call><property name="messageType" value="application/json" scope="axis2" type="STRING"/><respond/>
        </inSequence><outSequence/><faultSequence/>
    </resource><resource methods="POST" url-mapping="/placeOrder"><inSequence><header name="SOAPAction" action="set" scope="transport" value="urn:placeOrder"/><property name="REST_URL_POSTFIX" scope="axis2" action="remove"/><payloadFactory media-type="xml" template-type="freemarker"><format><![CDATA[<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
<soapenv:Header/>
<soapenv:Body>
<web:placeOrder xmlns:web="http://services.samples"><#if payload.placeOrder.order?has_content><web:order><#if payload.placeOrder.order.price?has_content><web:price>${payload.placeOrder.order.price}</web:price></#if><#if payload.placeOrder.order.quantity?has_content><web:quantity>${payload.placeOrder.order.quantity}</web:quantity></#if><#if payload.placeOrder.order.symbol?has_content><web:symbol>${payload.placeOrder.order.symbol}</web:symbol></#if></web:order></#if></web:placeOrder></soapenv:Body>
</soapenv:Envelope>
]]></format><args/>
            </payloadFactory><property name="messageType" value="application/soap+xml" scope="axis2" type="STRING"/><call><endpoint key="MessageProcessor_SOAP_ENDPOINT"/>
            </call><property name="messageType" value="application/json" scope="axis2" type="STRING"/><respond/>
        </inSequence><outSequence/><faultSequence/>
    </resource><resource methods="POST" url-mapping="/getFullQuote"><inSequence><header name="SOAPAction" action="set" scope="transport" value="urn:getFullQuote"/><property name="REST_URL_POSTFIX" scope="axis2" action="remove"/><payloadFactory media-type="xml" template-type="freemarker"><format><![CDATA[<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
<soapenv:Header/>
<soapenv:Body>
<web:getFullQuote xmlns:web="http://services.samples"><#if payload.getFullQuote.request?has_content><web:request><#if payload.getFullQuote.request.symbol?has_content><web:symbol>${payload.getFullQuote.request.symbol}</web:symbol></#if></web:request></#if></web:getFullQuote></soapenv:Body>
</soapenv:Envelope>
]]></format><args/>
            </payloadFactory><property name="messageType" value="application/soap+xml" scope="axis2" type="STRING"/><call><endpoint key="MessageProcessor_SOAP_ENDPOINT"/>
            </call><property name="messageType" value="application/json" scope="axis2" type="STRING"/><respond/>
        </inSequence><outSequence/><faultSequence/>
    </resource><resource methods="POST" url-mapping="/getQuote"><inSequence><header name="SOAPAction" action="set" scope="transport" value="urn:getQuote"/><property name="REST_URL_POSTFIX" scope="axis2" action="remove"/><payloadFactory media-type="xml" template-type="freemarker"><format><![CDATA[<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
<soapenv:Header/>
<soapenv:Body>
<web:getQuote xmlns:web="http://services.samples"><#if payload.getQuote.request?has_content><web:request><#if payload.getQuote.request.symbol?has_content><web:symbol>${payload.getQuote.request.symbol}</web:symbol></#if></web:request></#if></web:getQuote></soapenv:Body>
</soapenv:Envelope>
]]></format><args/>
            </payloadFactory><property name="messageType" value="application/soap+xml" scope="axis2" type="STRING"/><call><endpoint key="MessageProcessor_SOAP_ENDPOINT"/>
            </call><property name="messageType" value="application/json" scope="axis2" type="STRING"/><respond/>
        </inSequence><outSequence/><faultSequence/>
    </resource>
</api>